#!/usr/bin/env python3
# encoding: utf-8
# @author: hoojo
# @email: hoojo_@126.com
# @github: https://github.com/hooj0
# @create date: 2020-09-25 16:07:27
# @copyright by hoojo@2018
# @changelog python3 `asyncio -> coroutine` example


# ===============================================================================
# 标题：python3 asyncio coroutine example
# ===============================================================================
# 使用：
# -------------------------------------------------------------------------------
# 描述：利用异步模式进行并发多网页请求，能根据每个请求的地址返回正常的结果
#       在返回结果后进行回调，处理后续返回值结果业务
# -------------------------------------------------------------------------------


# -------------------------------------------------------------------------------
# 异步模式：
#       同时访问多个网址，返回结果后进行回调
# -------------------------------------------------------------------------------