#!/usr/bin/env python3
# encoding: utf-8
# @author: hoojo
# @email: hoojo_@126.com
# @github: https://github.com/hooj0
# @create date: 2020-09-25 16:07:27
# @copyright by hoojo@2018
# @changelog python3 `asyncio -> sync` example


# ===============================================================================
# 标题：python3 synchronize example
# ===============================================================================
# 使用：普通模式情况，不使用异步示例
# -------------------------------------------------------------------------------
# 描述：在不使用异步情况下，程序运行有序，需要等待前面程序运行完成后再执行下面任务
# -------------------------------------------------------------------------------


# -------------------------------------------------------------------------------
# 同步模式：
#       不使用异步情况下，输出时间是有序的
# -------------------------------------------------------------------------------
import time


def hello():
    time.sleep(1)


def run():
    for i in range(5):
        hello()
        print('Hello World: %s' % time.time())


if __name__ == '__main__':
    run()


# -------------------------------------------------------------------------------
# 结果输出：
#       程序有序输出，间隔 1毫秒
# -------------------------------------------------------------------------------
# Hello World: 1601018885.1223
# Hello World: 1601018886.122357
# Hello World: 1601018887.122414
# Hello World: 1601018888.1224713
# Hello World: 1601018889.1225286