#!/usr/bin/env python3
# encoding: utf-8
# @author: hoojo
# @email: hoojo_@126.com
# @github: https://github.com/hooj0
# @create date: 2020-10-23
# @copyright by hoojo@2020
# @changelog python3 `shell -> os.system` example


# ===============================================================================
# 标题：python3 call shell command os.system example
# ===============================================================================
# 使用：利用python调用shell命令行
#
# os.system（cmd），
#   其返回值是shell指令运行后返回的状态码，int类型，
#   0表示shell指令成功执行，256表示未找到，
#
#   该方法适用于shell命令不需要输出内容的场景。
# -------------------------------------------------------------------------------
# 描述：该方法适用于shell命令不需要输出内容的场景
# -------------------------------------------------------------------------------
import os

help(os.system)


# -------------------------------------------------------------------------------
# 执行ping命令
# -------------------------------------------------------------------------------
# os.system('ping www.baidu.com -t')

# output:
# ---------------------------------------------------------------------------
# 正在 Ping www.a.shifen.com [163.177.151.109] 具有 32 字节的数据:
# 来自 163.177.151.109 的回复: 字节=32 时间=6ms TTL=55
# 来自 163.177.151.109 的回复: 字节=32 时间=6ms TTL=55
# 来自 163.177.151.109 的回复: 字节=32 时间=6ms TTL=55
# 来自 163.177.151.109 的回复: 字节=32 时间=6ms TTL=55


# -------------------------------------------------------------------------------
# 执行dir命令
# -------------------------------------------------------------------------------
exit_code = os.system('dir')

# 正常退出
print(exit_code)    # 0

# output:
# ---------------------------------------------------------------------------
# 2020/10/23 周五  11:16    <DIR>          .
# 2020/10/23 周五  11:16    <DIR>          ..
# 2020/10/23 周五  11:16             2,038 shell_os_system.py
# 2020/10/23 周五  11:04             5,089 shell_subprocess.py
#                2 个文件          7,127 字节
#                2 个目录 20,369,563,648 可用字节